RIET/src/Documents/InventoryСписание/InventoryСписание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>InventoryСписание</name>
  <registerRecords>AccumulationRegister.ПроводкиDSSОбщие</registerRecords>
  <registerRecords>InformationRegister.РасчетСебестоимости</registerRecords>
  <registerRecords>AccumulationRegister.InventoryBatches</registerRecords>
  <attributes>
    <name>InventoryLocation</name>
    <type>
      <types>CatalogRef.InventoryLocations</types>
    </type>
  </attributes>
  <attributes>
    <name>TaxRegistration</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>IctDocType</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Segment</name>
    <type>
      <types>CatalogRef.Сегменты</types>
    </type>
  </attributes>
  <attributes>
    <name>HasFinishedGoods</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>LastModified</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Responsible</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Реализация</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Reference</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НалоговыйПериод</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>OriginalDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TransactionType</name>
    <type>
      <types>EnumRef.InventoryTransactionsTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>SO</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоверенностьПолучателяДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоверенностьОтправителяДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентПродажи</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>МатериалПолучил</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>МатериалПередал</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>LocationIn</name>
    <type>
      <types>CatalogRef.InventoryLocations</types>
    </type>
  </attributes>
  <attributes>
    <name>Defer</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Goods</name>
    <attributes>
      <name>Флаг</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Good</name>
      <type>
        <types>CatalogRef.InventoryGoods</types>
      </type>
    </attributes>
    <attributes>
      <name>UOM</name>
      <type>
        <types>CatalogRef.UOMs</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>FinishedGood</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>FinishedGoodPONumber</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ManagementPrice</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ManagementSum</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AU</name>
      <type>
        <types>CatalogRef.КостЦентры</types>
      </type>
    </attributes>
    <attributes>
      <name>Batch</name>
      <type>
        <types>DocumentRef.InventoryПоступление</types>
        <types>DocumentRef.InventoryКорректировка</types>
        <types>DocumentRef.InventoryПеремещение</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>ОСLawson</name>
      <type>
        <types>CatalogRef.ОсновныеСредстваLawson</types>
      </type>
    </attributes>
    <attributes>
      <name>TicketId</name>
      <type>
        <types>DocumentRef.SiebelOrders</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/InformationRegisters/РасчетСебестоимости/РасчетСебестоимости.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РасчетСебестоимости</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>DescriptionSO</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоSO</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмеренияSO</name>
    <type>
      <types>CatalogRef.UOMs</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.UOMs</types>
    </type>
  </resources>
  <resources>
    <name>СуммаСписания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Себестоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаSO</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Account</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ParentLineID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>РучнаяКорректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>SiebelOrder</name>
    <type>
      <types>DocumentRef.SiebelOrders</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Good</name>
    <type>
      <types>CatalogRef.InventoryGoods</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AU</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>PartNumberSO</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Реализация</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Списание</name>
    <type>
      <types>DocumentRef.InventoryСписание</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/InformationRegisters/InventoryLocationСведения/InventoryLocationСведения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>InventoryLocationСведения</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>ДоверенностьОтправителяДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДоверенностьПолучателяДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>МатериалПередал</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>МатериалПолучил</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <dimensions>
    <name>Location</name>
    <type>
      <types>CatalogRef.InventoryLocations</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/Catalogs/КостЦентры/КостЦентры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КостЦентры</name>
  <comment>Параллельный с подразделениями учет ОС </comment>
  <attributes>
    <name>Segment</name>
    <type>
      <types>CatalogRef.Сегменты</types>
    </type>
  </attributes>
  <attributes>
    <name>SubSegment</name>
    <type>
      <types>CatalogRef.Сегменты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сегмент</name>
    <type>
      <types>CatalogRef.Сегменты</types>
    </type>
  </attributes>
  <attributes>
    <name>DefaultActivity</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>OnlyMS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>TaxRegistration</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>NonLawson</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Geomarket</name>
    <type>
      <types>CatalogRef.GeoMarkets</types>
    </type>
  </attributes>
  <attributes>
    <name>SubGeomarket</name>
    <type>
      <types>CatalogRef.GeoMarkets</types>
    </type>
  </attributes>
</mdclass:Catalog>

RIET/src/Documents/InventoryСписание/Forms/ФормаДокумента/Module.bsl
//////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ОбщегоНазначения.УстановитьЗначение(ТекущийОбъект.Responsible, ПараметрыСеанса.ТекущийПользователь);
	ТекущийОбъект.LastModified = ТекущаяДата();
		
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////
// ТАБЛИЧНАЯ ЧАСТЬ GOODs

&НаКлиенте
Процедура GoodsQuantityПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Goods.ТекущиеДанные;
	ТекущиеДанные.ManagementSum = ТекущиеДанные.Quantity * ТекущиеДанные.ManagementPrice;
	
КонецПроцедуры

&НаКлиенте
Процедура GoodsManagementPriceПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Goods.ТекущиеДанные;
	ТекущиеДанные.ManagementSum = ТекущиеДанные.Quantity * ТекущиеДанные.ManagementPrice;
	
КонецПроцедуры

&НаКлиенте
Процедура GoodsManagementSumПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Goods.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.Quantity) Тогда
		ТекущиеДанные.ManagementPrice = ТекущиеДанные.ManagementSum / ТекущиеДанные.Quantity;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура BatchНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Goods.ТекущиеДанные;
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("Период", Объект.Дата);
	ПараметрыФормы.Вставить("Location", Объект.InventoryLocation);
	ПараметрыФормы.Вставить("AU", ТекущиеДанные.AU);
	ПараметрыФормы.Вставить("UOM", ТекущиеДанные.UOM);
	ПараметрыФормы.Вставить("Good", ТекущиеДанные.Good);
	
	ОткрытьФормуМодально("ОбщаяФорма.ФормаПодбораПартииМатериалов", ПараметрыФормы, Элемент);
	
КонецПроцедуры


&НаКлиенте
Процедура BatchОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.Goods.ТекущиеДанные;
	
	ТекущиеДанные.Batch = ВыбранноеЗначение.Batch;
	
КонецПроцедуры


&НаКлиенте
Процедура РеализацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	МассивКодов = Новый Массив;
	Для каждого СтрокаТЧ Из Объект.Goods Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.Good) Тогда
			МассивКодов.Добавить(СтрокаТЧ.Good.Код);
		КонецЕсли; 
	КонецЦикла; 
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("Сегмент", Объект.Segment);
	ПараметрыФормы.Вставить("Дата", ДобавитьМесяц(Объект.дата, -6));
	ПараметрыФормы.Вставить("МассивКодов", МассивКодов);
	ПараметрыФормы.Вставить("AU", Объект.Goods[0].AU);
	
	ОткрытьФормуМодально("Документ.InventoryСписание.Форма.ФормаВыбораРеализации", ПараметрыФормы, Элемент);
КонецПроцедуры


&НаКлиенте
Процедура РеализацияПриИзменении(Элемент)
	
	ПриИзмененииРеализации();
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииРеализации()

	Если ЗначениеЗаполнено(Объект.Реализация) Тогда
		Объект.НалоговыйПериод = Объект.Реализация.НалоговыйПериод;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	обновитьСчетаФактуры()
КонецПроцедуры

&НаКлиенте
Процедура GoodsРеализацияПриИзменении(Элемент)
	ОбновитьСчетаФактуры()
КонецПроцедуры

&НаСервере
Процедура обновитьСчетаФактуры()
	для каждого Стр из Объект.Goods цикл
		стр.СчетФактура = ОбщегоНазначения.НайтиПодчиненныйДокумент(Стр.Реализация, "СчетФактураВыданный");
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	//Добавила Федотова Л., РГ-Софт, 28.03.13, вопрос SLI-0003437
	Попытка
		Если ВладелецФормы.Заголовок = "ОсновныеСредства" Тогда
			СтруктураОповещения = Новый Структура("Документ", Объект.Ссылка);
			Оповестить("ДокументСписанияInventory", СтруктураОповещения);
		КонецЕсли; 
	Исключение
	КонецПопытки;
	//Конец добавления
	
КонецПроцедуры

//-> RG-Soft VIvanov 2015/02/18
&НаКлиенте
Процедура GoodsAUНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	текДанные = Элементы.Goods.ТекущиеДанные;
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Дата", Объект.Дата);
	СтруктураПараметров.Вставить("ТекущаяСтрока", текДанные.AU);
	ФормаВыбора = ПолучитьФорму("Справочник.КостЦентры.Форма.ФормаВыбораИзРегистра", СтруктураПараметров, Элемент);
	ФормаВыбора.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ФормаВыбора.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура GoodsAUАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Текст) Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыПолученияДанных.Вставить("Дата", Объект.Дата);
		//ДанныеВыбора = ПолучитьДанныеВыбора(Тип("СправочникСсылка.КостЦентры"), Параметры);
		ДанныеВыбора = РГСофт.ПолучитьДанныеВыбораКостЦентров(ПараметрыПолученияДанных);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура GoodsAUОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Текст) Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыПолученияДанных.Вставить("Дата", Объект.Дата);
		//ДанныеВыбора = ПолучитьДанныеВыбора(Тип("СправочникСсылка.КостЦентры"), Параметры);
		ДанныеВыбора = РГСофт.ПолучитьДанныеВыбораКостЦентров(ПараметрыПолученияДанных);
	КонецЕсли;
	
КонецПроцедуры
//<- RG-Soft VIvanov

// { RGS MYurkevich 7/13/2015 4:03:00 PM - 
&НаКлиенте
Процедура РедактироватьСебестоимость(Команда)
	ПараметрыФормы = Новый Структура;
	Отбор  = Новый Структура;      
	Отбор.Вставить("Регистратор",Объект.Ссылка);
	ПараметрыФормы.Вставить("Отбор",Отбор);
	ОткрытьФорму("РегистрСведений.РасчетСебестоимости.Форма.ФормаНабораЗаписей", ПараметрыФормы);
КонецПроцедуры
// } RGS MYurkevich 7/13/2015 4:03:00 PM -

// { RGS AArsentev 10.10.2016 18:14:05 - SLI-0006848
&НаКлиенте
Процедура ВключитьВсе(Команда)
	
	Для Каждого СтрокаТЧ Из Объект.Goods Цикл
		СтрокаТЧ.Флаг = Истина;		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ИсключитьВсе(Команда)
	
	Для Каждого СтрокаТЧ Из Объект.Goods Цикл
		СтрокаТЧ.Флаг = Ложь;		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьPref_Реализацию(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ЗаполнитьИнвентори", ЭтотОбъект); 
	ОткрытьФорму("ОбщаяФорма.ИнвенториЗаполнениеСписание", , , , , , Оповещение);
	
КонецПроцедуры

&НаКлиенте 
Процедура ЗаполнитьИнвентори(Результат, ДополнительныеПараметры) Экспорт  
	
	Если Результат <> Неопределено Тогда
		Если Вопрос("Текущие данные в колонке Реализация будут перезаполнены! Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
			Возврат;	
		КонецЕсли;
		Для Каждого Элемент из Объект.Goods Цикл
			
			Если Не Элемент.Флаг тогда
				Продолжить
			Иначе
				Если ЗначениеЗаполнено(Результат.Реализация) Тогда
					Элемент.Реализация = Результат.Реализация;
				КонецЕсли;
				Если ЗначениеЗаполнено(Результат.ticked) Тогда
					Элемент.TicketId = Результат.ticked;
				КонецЕсли;
			КонецЕсли;									
		КонецЦикла;
		ОбновитьСчетаФактуры()
	Иначе
		Возврат
	КонецЕсли;	

КонецПроцедуры 
// } RGS AArsentev 10.10.2016 18:14:05 - SLI-0006848

// { RGS LFedotova 22.12.2016 18:54:53 - вопрос SLI-0007006
&НаКлиенте
Процедура LocationInПриИзменении(Элемент)
	LocationInПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура LocationInПриИзмененииНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	InventoryLocationСведенияСрезПоследних.Location,
		|	InventoryLocationСведенияСрезПоследних.Отправитель,
		|	InventoryLocationСведенияСрезПоследних.Получатель,
		|	InventoryLocationСведенияСрезПоследних.ДоверенностьОтправителяДата,
		|	InventoryLocationСведенияСрезПоследних.ДоверенностьПолучателяДата,
		|	InventoryLocationСведенияСрезПоследних.МатериалПередал,
		|	InventoryLocationСведенияСрезПоследних.МатериалПолучил
		|ИЗ
		|	РегистрСведений.InventoryLocationСведения.СрезПоследних(&Дата, Location = &Location) КАК InventoryLocationСведенияСрезПоследних";
	
	Запрос.УстановитьПараметр("Location", Объект.LocationIn);
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Объект,ВыборкаДетальныеЗаписи);	
	КонецЦикла;
	
КонецПроцедуры
// } RGS LFedotova 22.12.2016 18:55:14 - вопрос SLI-0007006

// { RGS LFedotova 25.10.2018 21:13:48 - вопрос SLI-0007720
&НаКлиенте
Процедура Defer(Команда)
	Объект.Defer = Истина;
КонецПроцедуры
// } RGS LFedotova 25.10.2018 21:13:57 - вопрос SLI-0007720
